In [7]:
import pandas as pd
items = {
    'Bob': pd.Series(data=[290, 250, 230], index=['bike', 'pants', 'watch']),
    'Alice': pd.Series(data=[40, 80, 97, 110], index=['book', 'glasses', 'bike', 'pants'])
}
items

{'Bob': bike     290
 pants    250
 watch    230
 dtype: int64, 'Alice': book        40
 glasses     80
 bike        97
 pants      110
 dtype: int64}

In [6]:
shopping_charts = pd.DataFrame(items)
shopping_charts

           Bob  Alice
bike     290.0   97.0
book       NaN   40.0
glasses    NaN   80.0
pants    250.0  110.0
watch    230.0    NaN

In [14]:
# We create a dictionary of Pandas Series without indexes
data = {
    'Bob': pd.Series([100, 100, 100]),
    'Alice': pd.Series([40, 40, 40])
}
df = pd.DataFrame(data)
df

   Bob  Alice
0  100     40
1  100     40
2  100     40

In [16]:
# We Create a DataFrame that only has Bob's data
bob_shopping_cart = pd.DataFrame(items, columns=['Bob'])

# We display bob_shopping_cart
bob_shopping_cart

       Bob
bike   290
pants  250
watch  230

In [17]:
# We Create a DataFrame that only has selected items for both Alice and Bob
sel_shopping_cart = pd.DataFrame(items, index = ['pants', 'book'])

# We display sel_shopping_cart
sel_shopping_cart

         Bob  Alice
pants  250.0    110
book     NaN     40

In [18]:
# We Create a DataFrame that only has selected items for Alice
alice_sel_shopping_cart = pd.DataFrame(items, index = ['glasses', 'bike'], columns = ['Alice'])

# We display alice_sel_shopping_cart
alice_sel_shopping_cart

         Alice
glasses     80
bike        97

In [20]:
# create a dictionary from the list [arrays]
data = {
    'integers': [1, 10, 20],
    'Floats': [1.1, 10.1, 20.1]
}
df = pd.DataFrame(data)
df

   integers  Floats
0         1     1.1
1        10    10.1
2        20    20.1

In [21]:
# Create a dataframe and provide the row index
df = pd.DataFrame(data, index=['label1', 'label2', 'label3'])
df

        integers  Floats
label1         1     1.1
label2        10    10.1
label3        20    20.1

In [52]:
# We create a list of Python dictionaries
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35}, 
          {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5}]

# We create a DataFrame 
store_items = pd.DataFrame(items2)

# We display the DataFrame
store_items

   bikes  pants  watches  glasses
0     20     30       35      NaN
1     15      5       10     50.0

In [58]:
# Accessing elements in dataframe
store_items = pd.DataFrame(items2, index=['store1', 'store2'])
store_items

        bikes  pants  watches  glasses
store1     20     30       35      NaN
store2     15      5       10     50.0

In [61]:
store_items[['bikes']]
store_items.loc[['store1']]
store_items['bikes']['store2']
store_items
# adding a new column
# store_items['shirts'] = [15, 4]

        bikes  pants  watches  glasses
store1     20     30       35      NaN
store2     15      5       10     50.0

In [69]:
# Adding colomns to dtaframe
# new_items = [{'bikes': 30, 'pants': 20, 'watches': 36, 'glasses': 4}]
# new_store = pd.DataFrame(new_items, index=['store3'])
# store_items = store_items.append(new_store)
store_items

        bikes  pants  watches  glasses
store1     20     30       35      NaN
store2     15      5       10     50.0
store3     30     20       36      4.0
store3     30     20       36      4.0
store3     30     20       36      4.0

In [72]:
# dataframe.insert(loc,label,data) method allows us to insert a new column in the dataframe at location loc, with the given column label, and given data
print(store_items)
store_items.insert(3, 'new Watches', [0, 9, 9, 9, 0])
store_items

        bikes  pants  watches  new Watches  glasses
store1     20     30       35            0      NaN
store2     15      5       10            9     50.0
store3     30     20       36            9      4.0
store3     30     20       36            9      4.0
store3     30     20       36            0      4.0

ValueError: cannot insert new Watches, already exists

In [74]:
# We remove the new watches column
store_items.pop('new Watches')

# we display the modified DataFrame
store_items

        bikes  pants  watches  glasses
store1     20     30       35      NaN
store2     15      5       10     50.0
store3     30     20       36      4.0
store3     30     20       36      4.0
store3     30     20       36      4.0

In [75]:
# We remove the store 2 and store 1 rows
store_items = store_items.drop(['store3'], axis = 0)

# we display the modified DataFrame
store_items

        bikes  pants  watches  glasses
store1     20     30       35      NaN
store2     15      5       10     50.0

In [76]:
store_items = store_items.rename(index={'store1': 'First Store'})
store_items

             bikes  pants  watches  glasses
First Store     20     30       35      NaN
store2          15      5       10     50.0

In [4]:
# Dealing with NaN values
import pandas as pd
# We create a list of Python dictionaries
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35, 'shirts': 15, 'shoes':8, 'suits':45},
{'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5, 'shirts': 2, 'shoes':5, 'suits':7},
{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes':10}]
store_items = pd.DataFrame(items2, index = ['store1', 'store2', 'store3'])
store_items

        bikes  pants  watches  shirts  shoes  suits  glasses
store1     20     30       35    15.0      8   45.0      NaN
store2     15      5       10     2.0      5    7.0     50.0
store3     20     30       35     NaN     10    NaN      4.0

In [8]:
print('NaN values', store_items.isnull().sum().sum())
print('non-NaN values', store_items.count())

NaN values 3
non-NaN values bikes      3
pants      3
watches    3
shirts     2
shoes      3
suits      2
glasses    2
dtype: int64

In [10]:
# .dropna(axis) method eliminates any rows with NaN values
store_items.dropna(axis=0)
#  eliminate any columns with NaN values when axis = 1 is used
store_items.dropna(axis=1)

        bikes  pants  watches  shoes
store1     20     30       35      8
store2     15      5       10      5
store3     20     30       35     10

In [11]:
# We replace all NaN values with 0 using fillna()
store_items.fillna(0)

        bikes  pants  watches  shirts  shoes  suits  glasses
store1     20     30       35    15.0      8   45.0      0.0
store2     15      5       10     2.0      5    7.0     50.0
store3     20     30       35     0.0     10    0.0      4.0

In [12]:
# .fillna(method = 'ffill', axis) will use the forward filling (ffill) method to replace NaN values using the previous known value along the given axis
store_items.fillna(method='ffill', axis=0)

        bikes  pants  watches  shirts  shoes  suits  glasses
store1     20     30       35    15.0      8   45.0      NaN
store2     15      5       10     2.0      5    7.0     50.0
store3     20     30       35     2.0     10    7.0      4.0

In [13]:
# We replace NaN values with the previous value in the row
store_items.fillna(method = 'ffill', axis = 1)

        bikes  pants  watches  shirts  shoes  suits  glasses
store1   20.0   30.0     35.0    15.0    8.0   45.0     45.0
store2   15.0    5.0     10.0     2.0    5.0    7.0     50.0
store3   20.0   30.0     35.0    35.0   10.0   10.0      4.0

In [14]:
# We replace NaN values with the next value in the column
store_items.fillna(method = 'backfill', axis = 0)

        bikes  pants  watches  shirts  shoes  suits  glasses
store1     20     30       35    15.0      8   45.0     50.0
store2     15      5       10     2.0      5    7.0     50.0
store3     20     30       35     NaN     10    NaN      4.0

In [15]:
# We replace NaN values by using linear interpolation using column values
store_items.interpolate(method = 'linear', axis = 0)

        bikes  pants  watches  shirts  shoes  suits  glasses
store1     20     30       35    15.0      8   45.0      NaN
store2     15      5       10     2.0      5    7.0     50.0
store3     20     30       35     2.0     10    7.0      4.0

In [20]:
# We load Google stock data in a DataFrame
Google_stock = pd.read_csv('goog-1.csv')

# We print some information about Google_stock
print('Google_stock is of type:', type(Google_stock))
print('Google_stock has shape:', Google_stock.shape)
Google_stock

Google_stock is of type: <class 'pandas.core.frame.DataFrame'>
Google_stock has shape: (3313, 7)

,Date,Open,High,Low,Close,Adj Close,Volume
0,2004-08-19,49.676899,51.693783,47.669952,49.845802,49.845802,44994500
1,2004-08-20,50.178635,54.187561,49.925285,53.805050,53.805050,23005800
2,2004-08-23,55.017166,56.373344,54.172661,54.346527,54.346527,18393200
3,2004-08-24,55.260582,55.439419,51.450363,52.096165,52.096165,15361800
4,2004-08-25,52.140873,53.651051,51.604362,52.657513,52.657513,9257400
...,...,...,...,...,...,...,...
3308,2017-10-09,980.000000,985.424988,976.109985,977.000000,977.000000,891400
3309,2017-10-10,980.000000,981.570007,966.080017,972.599976,972.599976,968400
3310,2017-10-11,973.719971,990.710022,972.250000,989.250000,989.250000,1693300
3311,2017-10-12,987.450012,994.119995,985.000000,987.830017,987.830017,1262400
3312,2017-10-13,992.000000,997.210022,989.000000,989.679993,989.679993,1157700

In [21]:
# We can take a look at the first 5 rows of data using the .head(N) method,
Google_stock.head()

         Date       Open       High        Low      Close  Adj Close    Volume
0  2004-08-19  49.676899  51.693783  47.669952  49.845802  49.845802  44994500
1  2004-08-20  50.178635  54.187561  49.925285  53.805050  53.805050  23005800
2  2004-08-23  55.017166  56.373344  54.172661  54.346527  54.346527  18393200
3  2004-08-24  55.260582  55.439419  51.450363  52.096165  52.096165  15361800
4  2004-08-25  52.140873  53.651051  51.604362  52.657513  52.657513   9257400

In [22]:
# We can also take a look at the last 5 rows of data by using the .tail(N) method
Google_stock.tail()

,Date,Open,High,Low,Close,Adj Close,Volume
3308,2017-10-09,980.000000,985.424988,976.109985,977.000000,977.000000,891400
3309,2017-10-10,980.000000,981.570007,966.080017,972.599976,972.599976,968400
3310,2017-10-11,973.719971,990.710022,972.250000,989.250000,989.250000,1693300
3311,2017-10-12,987.450012,994.119995,985.000000,987.830017,987.830017,1262400
3312,2017-10-13,992.000000,997.210022,989.000000,989.679993,989.679993,1157700

In [23]:
# Let's do a quick check to see whether we have any NaN values in our dataset
Google_stock.isnull().any()

Date         False
Open         False
High         False
Low          False
Close        False
Adj Close    False
Volume       False
dtype: bool

In [24]:
# Pandas provides the .describe() method to get descriptive statistics on each column of the DataFrame
Google_stock.describe()

,Open,High,Low,Close,Adj Close,Volume
count,3313.000000,3313.000000,3313.000000,3313.000000,3313.000000,3.313000e+03
mean,380.186092,383.493740,376.519309,380.072458,380.072458,8.038476e+06
std,223.818650,224.974534,222.473232,223.853780,223.853780,8.399521e+06
min,49.274517,50.541279,47.669952,49.681866,49.681866,7.900000e+03
25%,226.556473,228.394516,224.003082,226.407440,226.407440,2.584900e+06
50%,293.312286,295.433502,289.929291,293.029114,293.029114,5.281300e+06
75%,536.650024,540.000000,532.409973,536.690002,536.690002,1.065370e+07
max,992.000000,997.210022,989.000000,989.679993,989.679993,8.276810e+07

In [25]:
# We get descriptive statistics on a single column of our DataFrame
Google_stock['Adj Close'].describe()

count    3313.000000
mean      380.072458
std       223.853780
min        49.681866
25%       226.407440
50%       293.029114
75%       536.690002
max       989.679993
Name: Adj Close, dtype: float64

In [26]:
# We print information about our DataFrame  
print()
print('Maximum values of each column:\n', Google_stock.max())
print()
print('Minimum Close value:', Google_stock['Close'].min())
print()
print('Average value of each column:\n', Google_stock.mean())

Maximum values of each column:
 Date         2017-10-13
Open                992
High             997.21
Low                 989
Close            989.68
Adj Close        989.68
Volume         82768100
dtype: object

Minimum Close value: 49.681866

Average value of each column:
 Open         3.801861e+02
High         3.834937e+02
Low          3.765193e+02
Close        3.800725e+02
Adj Close    3.800725e+02
Volume       8.038476e+06
dtype: float64

In [27]:
# We display the correlation between columns
Google_stock.corr()

               Open      High       Low     Close  Adj Close    Volume
Open       1.000000  0.999904  0.999845  0.999745   0.999745 -0.564258
High       0.999904  1.000000  0.999834  0.999868   0.999868 -0.562749
Low        0.999845  0.999834  1.000000  0.999899   0.999899 -0.567007
Close      0.999745  0.999868  0.999899  1.000000   1.000000 -0.564967
Adj Close  0.999745  0.999868  0.999899  1.000000   1.000000 -0.564967
Volume    -0.564258 -0.562749 -0.567007 -0.564967  -0.564967  1.000000

In [30]:
Google_stock.groupby(['Date'])['Low'].sum()

Date
2004-08-19     47.669952
2004-08-20     49.925285
2004-08-23     54.172661
2004-08-24     51.450363
2004-08-25     51.604362
                 ...
2017-10-09    976.109985
2017-10-10    966.080017
2017-10-11    972.250000
2017-10-12    985.000000
2017-10-13    989.000000
Name: Low, Length: 3313, dtype: float64

In [32]:
Google_stock.groupby(['Date', 'High'])['Volume'].sum().tail()

Date        High
2017-10-09  985.424988     891400
2017-10-10  981.570007     968400
2017-10-11  990.710022    1693300
2017-10-12  994.119995    1262400
2017-10-13  997.210022    1157700
Name: Volume, dtype: int64